000010 IDENTIFICATION  DIVISION.
000020 CLASS-ID. mybarInt.
000030 ENVIRONMENT DIVISION.
000040 CONFIGURATION SECTION.
000050 REPOSITORY.
000060     CLASS SYS-INT32_Obj AS "System.Int32".
000070 OBJECT.
000080 PROCEDURE DIVISION.
000090 METHOD-ID. NEW.
000100 DATA DIVISION.
000110 WORKING-STORAGE SECTION.
000120 01 myInt1_Obj OBJECT REFERENCE SYS-INT32_Obj.
000130 LINKAGE SECTION.
000140 01 myInt1 PIC S9(9) USAGE COMP-5.
000150 PROCEDURE DIVISION USING BY VALUE myInt1.
000160    SET myInt1_Obj TO myInt1.
000170 END METHOD NEW.
000180 END OBJECT.
000190 END CLASS mybarInt.