000010 IDENTIFICATION  DIVISION.
000020 CLASS-ID. mybarStr.
000030 ENVIRONMENT DIVISION.
000040 CONFIGURATION SECTION.
000050 REPOSITORY.
000060     CLASS SYS-STRING_Obj AS "System.String".
000070 OBJECT.
000080 PROCEDURE DIVISION.
000090 METHOD-ID. NEW.
000100 DATA DIVISION.
000110 WORKING-STORAGE SECTION.
000120 01 myStr_Obj OBJECT REFERENCE SYS-STRING_Obj.
000130 LINKAGE SECTION.
000140 01 myStr OBJECT REFERENCE SYS-STRING_Obj.
000150 PROCEDURE DIVISION USING BY VALUE myStr.
000160     SET myStr_Obj TO myStr.
000170 END METHOD NEW.
000180 END OBJECT.
000190 END CLASS mybarStr.