000010 IDENTIFICATION DIVISION.
000020 CLASS-ID. WebForm1 AS "MyWebUseValidationCobol.WebForm1"
000030     INHERITS CLASS-PAGE.
000040 ENVIRONMENT DIVISION.
000050 CONFIGURATION SECTION.
000060 SPECIAL-NAMES.
000070 REPOSITORY.
000080     CLASS CLASS-EVENTARGS AS "System.EventArgs"
000090     DELEGATE DELEGATE-EVENTHANDLER AS "System.EventHandler"
000100     CLASS CLASS-OBJECT AS "System.Object"
000110     CLASS CLASS-PAGE AS "System.Web.UI.Page"
000120     CLASS CLASS-BUTTON AS "System.Web.UI.WebControls.Button"
000130     CLASS CLASS-COMPAREVALIDATOR AS "System.Web.UI.WebControls.CompareValidator"
000140     CLASS CLASS-RANGEVALIDATOR AS "System.Web.UI.WebControls.RangeValidator"
000150     CLASS CLASS-REGULAREXPRESSIONVALIDAT AS "System.Web.UI.WebControls.RegularExpressionValidator"
000160     CLASS CLASS-REQUIREDFIELDVALIDATOR AS "System.Web.UI.WebControls.RequiredFieldValidator"
000170     CLASS CLASS-TEXTBOX AS "System.Web.UI.WebControls.TextBox"
000180     CLASS CLASS-VALIDATIONSUMMARY AS "System.Web.UI.WebControls.ValidationSummary"
000190     .
000200
000210 OBJECT.
000220 DATA DIVISION.
000230 WORKING-STORAGE SECTION.
000240 01 TextBox1 OBJECT REFERENCE CLASS-TEXTBOX PROPERTY.
000250 01 TextBox2 OBJECT REFERENCE CLASS-TEXTBOX PROPERTY.
000260 01 CompareValidator1 OBJECT REFERENCE CLASS-COMPAREVALIDATOR PROPERTY.
000270 01 RangeValidator1 OBJECT REFERENCE CLASS-RANGEVALIDATOR PROPERTY.
000280 01 RegularExpressionValidator1 OBJECT REFERENCE CLASS-REGULAREXPRESSIONVALIDAT PROPERTY.
000290 01 RequiredFieldValidator1 OBJECT REFERENCE CLASS-REQUIREDFIELDVALIDATOR PROPERTY.
000300 01 ValidationSummary1 OBJECT REFERENCE CLASS-VALIDATIONSUMMARY PROPERTY.
000310 01 TextBox3 OBJECT REFERENCE CLASS-TEXTBOX PROPERTY.
000320 01 TextBox4 OBJECT REFERENCE CLASS-TEXTBOX PROPERTY.
000330 01 Button1 OBJECT REFERENCE CLASS-BUTTON PROPERTY.
000340 PROCEDURE DIVISION.
000350
000360* Required method for Designer support - do not modify
000370* the contents of this method with the code editor.
000380 METHOD-ID. INITIALIZECOMPONENT AS "InitializeComponent" PRIVATE.
000390 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000410 01 TEMP1 OBJECT REFERENCE DELEGATE-EVENTHANDLER.
000420 PROCEDURE DIVISION.
000430*>>IMP BEGIN-EMBEDDED-CODEDOM
000440*<embedded-codedom>
000450*<object type="System.CodeDom.CodeAttachEventStatement">
000460*<prop name="Event">
000470*<object type="System.CodeDom.CodeEventReferenceExpression">
000480*<prop name="TargetObject">
000490*<object type="System.CodeDom.CodeThisReferenceExpression">
000500*</object>
000510*</prop>
000520*<prop name="EventName">
000530*<string value="Load" />
000540*</prop>
000550*</object>
000560*</prop>
000570*<prop name="Listener">
000580*<object type="System.CodeDom.CodeDelegateCreateExpression">
000590*<prop name="DelegateType">
000600*<object type="System.CodeDom.CodeTypeReference">
000610*<prop name="BaseType">
000620*<string value="System.EventHandler" />
000630*</prop>
000640*</object>
000650*</prop>
000660*<prop name="TargetObject">
000670*<object type="System.CodeDom.CodeThisReferenceExpression">
000680*</object>
000690*</prop>
000700*<prop name="MethodName">
000710*<string value="Page_Load" />
000720*</prop>
000730*</object>
000740*</prop>
000750*</object>
000760*</embedded-codedom>
000770*>>IMP END-EMBEDDED-CODEDOM
000780     INVOKE DELEGATE-EVENTHANDLER "NEW" USING BY VALUE SELF BY VALUE N"Page_Load" RETURNING TEMP1
000790     INVOKE SELF "add_Load" USING BY VALUE TEMP1
000800 END METHOD INITIALIZECOMPONENT.
000810
000820 METHOD-ID. ONINIT AS "OnInit" OVERRIDE PROTECTED.
000830 DATA DIVISION.
000840 LINKAGE SECTION.
000850 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000860 PROCEDURE DIVISION USING BY VALUE PARAM-E.
000870     INVOKE SELF "InitializeComponent".
000880     INVOKE SUPER "OnInit" USING BY VALUE PARAM-E.
000890 END METHOD ONINIT.
000900
000910 METHOD-ID. PAGE_LOAD AS "Page_Load" PRIVATE.
000920 DATA DIVISION.
000930 LINKAGE SECTION.
000940 01 PARAM-SENDER OBJECT REFERENCE CLASS-OBJECT.
000950 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000960 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000970 END METHOD PAGE_LOAD.
000980
000990 END OBJECT.
001000 END CLASS WebForm1.