000010 IDENTIFICATION DIVISION.
000020 CLASS-ID. GLOBAL-CLASS AS "StateManagementCobol.AppGlobal" INHERITS CLASS-HTTPAPPLICATION.
000030 ENVIRONMENT DIVISION.
000040 CONFIGURATION SECTION.
000050 SPECIAL-NAMES.
000060 REPOSITORY.
000070     CLASS CLASS-EVENTARGS AS "System.EventArgs"
000080     CLASS CLASS-OBJECT AS "System.Object"
000090     CLASS CLASS-HTTPAPPLICATION AS "System.Web.HttpApplication"
000091     CLASS CLASS-HttpApplicationState AS "System.Web.HttpApplicationState"
000092     PROPERTY PROP-APPLICATION AS "Application"
000093     PROPERTY PROP-NOW AS "Now"
000094     CLASS CLASS-DATETIME AS "System.DateTime"
000095     PROPERTY PROP-SESSION AS "Session"
000096     PROPERTY PROP-SESSIONID AS "SessionID"
000097     CLASS CLASS-HttpSessionState AS "System.Web.SessionState.HttpSessionState"
000098     CLASS CLASS-HTTPCONTEXT AS "System.Web.HttpContext"
000099     PROPERTY PROP-CURRENT AS "Current"
000101     .
000110
000120 STATIC.
000130 DATA DIVISION.
000140 WORKING-STORAGE SECTION.
000150 PROCEDURE DIVISION.
000160
000170 END STATIC.
000180
000190 OBJECT.
000200 DATA DIVISION.
000210 WORKING-STORAGE SECTION.
000220 PROCEDURE DIVISION.
000230
000240 METHOD-ID. NEW.
000250 PROCEDURE DIVISION.
000260     INVOKE SELF "InitializeComponent".
000270 END METHOD NEW.
000280
000290 METHOD-ID. APPLICATION_START AS "Application_Start" IS PROTECTED.
000300 DATA DIVISION.
000301 WORKING-STORAGE SECTION.
000302   01 MyHttpApplicationState         OBJECT REFERENCE CLASS-HttpApplicationState.
000303   01 NowDateTime                    OBJECT REFERENCE CLASS-DATETIME.
000310 LINKAGE SECTION.
000320 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000330 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000340 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000341 
000342     SET NowDateTime TO PROP-NOW OF CLASS-DATETIME
000343     SET MyHttpApplicationState TO PROP-APPLICATION OF SELF
000344     INVOKE MyHttpApplicationState "set_Item" 
000345     USING BY VALUE "MyTimeTheAppStarted" NowDateTime
000350     
000360 END METHOD APPLICATION_START.
000370
000380 METHOD-ID. SESSION_START AS "Session_Start" IS PROTECTED.
000390 DATA DIVISION.
000391 WORKING-STORAGE SECTION.
000392   01 MyHttpSessionState         OBJECT REFERENCE CLASS-HttpSessionState.
000394   01 NowDateTime                OBJECT REFERENCE CLASS-DATETIME.
000395   01 MiscString1                PIC X(25).
000396   01 MyCurrentContext           OBJECT REFERENCE CLASS-HTTPCONTEXT.
000400 LINKAGE SECTION.
000410 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000420 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000430 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000431 
000432     SET NowDateTime TO PROP-NOW OF CLASS-DATETIME
000433     SET MyHttpSessionState TO PROP-SESSION OF SELF
000434     INVOKE MyHttpSessionState "set_Item" 
000435     USING BY VALUE "MyTimeTheSessionStarted" NowDateTime
000436     
000437     SET MyCurrentContext TO PROP-CURRENT OF CLASS-HTTPCONTEXT
000438	   SET MyHttpSessionState TO PROP-SESSION OF MyCurrentContext
000439     SET MiscString1 TO PROP-SESSIONID OF MyHttpSessionState
000440     INVOKE MyHttpSessionState "set_Item" 
000441     USING BY VALUE "MyTimeTheSessionIdentity" MiscString1
000442     
000450 END METHOD SESSION_START.
000460
000470 METHOD-ID. APPLICATION_BEGINREQUEST 
000471            AS "Application_BeginRequest" IS PROTECTED.
000480 DATA DIVISION.
000481 WORKING-STORAGE SECTION.
000483   01 MyHttpApplicationState         OBJECT REFERENCE CLASS-HttpApplicationState.
000484   01 NowDateTime                    OBJECT REFERENCE CLASS-DATETIME.
000490 LINKAGE SECTION.
000500 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000510 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000520 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000521     
000523     SET NowDateTime TO PROP-NOW OF CLASS-DATETIME
000524     SET MyHttpApplicationState TO PROP-APPLICATION OF SELF
000525     INVOKE MyHttpApplicationState "set_Item" 
000526     USING BY VALUE "MyTimeTheLastRequestWasMade" NowDateTime
000530     
000540 END METHOD APPLICATION_BEGINREQUEST.
000550
000560 METHOD-ID. APPLICATION_ENDREQUEST AS "Application_EndRequest" IS PROTECTED.
000570 DATA DIVISION.
000580 LINKAGE SECTION.
000590 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000600 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000610 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000620     
000630 END METHOD APPLICATION_ENDREQUEST.
000640
000650 METHOD-ID. APPLICATION_AUTHREQUEST AS "Application_AuthenticateRequest" IS PROTECTED.
000660 DATA DIVISION.
000670 LINKAGE SECTION.
000680 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000690 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000700 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000710     
000720 END METHOD APPLICATION_AUTHREQUEST.
000730
000740 METHOD-ID. APPLICATION_ERROR AS "Application_Error" IS PROTECTED.
000750 DATA DIVISION.
000760 LINKAGE SECTION.
000770 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000780 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000790 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000800     
000810 END METHOD APPLICATION_ERROR.
000820
000830 METHOD-ID. SESSION_END AS "Session_End" IS PROTECTED.
000840 DATA DIVISION.
000850 LINKAGE SECTION.
000860 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000870 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000880 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000890     
000900 END METHOD SESSION_END.
000910
000920 METHOD-ID. APPLICATION_END AS "Application_End" IS PROTECTED.
000930 DATA DIVISION.
000940 LINKAGE SECTION.
000950 01 PARAM-SENDER OBJECT REFERENCE  CLASS-OBJECT.
000960 01 PARAM-E OBJECT REFERENCE CLASS-EVENTARGS.
000970 PROCEDURE DIVISION USING BY VALUE PARAM-SENDER PARAM-E.
000980     
000990 END METHOD APPLICATION_END.
001000
001010* Required method for Designer support - do not modify
001020* the contents of this method with the code editor.
001030 METHOD-ID. INITIALIZECOMPONENT AS "InitializeComponent" IS PRIVATE.
001040 PROCEDURE DIVISION.
001050*>>IMP BEGIN-EMBEDDED-CODEDOM
001060*<embedded-codedom>
001070*</embedded-codedom>
001080*>>IMP END-EMBEDDED-CODEDOM
001090 END METHOD INITIALIZECOMPONENT.
001100
001110 END OBJECT.
001120 END CLASS GLOBAL-CLASS.
001130