000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. MAIN.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000051 01 NULL-X PIC X(1).
000060 PROCEDURE DIVISION.
000070     DISPLAY "Hello, .NET World.".
000071     DISPLAY "I Cannot believe how simple this is!".
000072     DISPLAY "Enter X and Press Enter to Exit.".
000073     ACCEPT NULL-X. 
000080 END PROGRAM MAIN.
000090